import { defineStore } from 'pinia'

export const useGlobalVariablesStore = defineStore('GlobalVariablesStore', () => {
  const companyName = 'ФОП Мінін Сергій Валентинович';
  const address = 'м. Дніпро';
  const reviews = {
    1: {
      id: 1,
      client: 'Олександр',
      stars: 1,
      date: '12.03.2023',
      text: 'Хлопці молодці, швидко приїхали та допомогли перевезти вантаж з Дніпра до Львова. Рекомендую, якість та швидкість гарантована!',
    },
    2: {
      id: 2,
      client: 'Маша',
      stars: 2,
      date: '02.11.2022',
      text: 'Хлопці молодці, швидко приїхали та допомогли перевезти вантаж з Дніпра до Львова. Рекомендую, якість та швидкість гарантована!',
    },
    3: {
      id: 3,
      client: 'Олександра',
      stars: 3,
      date: '15.07.2023',
      text: 'Хлопці молодці, швидко приїхали та допомогли перевезти вантаж з Дніпра до Львова. Рекомендую, якість та швидкість гарантована!',
    },
    4: {
      id: 4,
      client: 'Микола Петрович',
      stars: 4,
      date: '25.02.2022',
      text: 'Хлопці молодці, швидко приїхали та допомогли перевезти вантаж з Дніпра до Львова. Рекомендую, якість та швидкість гарантована!',
    },
    5: {
      id: 5,
      client: 'Лариса',
      stars: 5,
      date: '25.02.2022',
      text: 'Хлопці молодці, швидко приїхали та допомогли перевезти вантаж з Дніпра до Львова. Рекомендую, якість та швидкість гарантована!',
    },
  }
  const products = {
    1: {
      id: 1,
      image: '1.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    2: {
      id: 2,
      image: '2.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    3: {
      id: 3,
      image: '3.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    4: {
      id: 4,
      image: '4.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    5: {
      id: 5,
      image: '5.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    6: {
      id: 6,
      image: '6.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
    7: {
      id: 7,
      image: '6.png',
      title: 'Фура великогабаритна',
      price: 'Ціну уточнюйте за номером телефону',
      phones: ['777'],
    },
  };

  return {
    companyName,
    address,
    reviews,
    products,
  }
});