<style scoped lang="scss">
  @import '@/assets/styles/variables.scss';
  .about-us {
    width: 1fr;
    height: fit-content;
    padding: 15px;
    background-color: $window-color;
    box-shadow: 0px 2px 4px 0px #00000040;
  }
</style>

<template>
  <div class="about-us">
    Ласкаво просимо на наш вебсайт!
    Ми пропонуємо вам високоякісні та надійні послуги з організації грузоперевезень. Наша команда зосереджена на створенні сервісу, який відповідає найвищим стандартам якості.
    Ми розуміємо, наскільки важливо для вас мати доступ до надійного та ефективного транспорту для перевезення вантажів. Тому ми працюємо над постійним поліпшенням наших послуг з надання грузових транспортних засобів, щоб забезпечити вам максимальну задоволеність.
    Окрім того, наша компанія пропонує послуги грузового маніпулятора, який працює цілодобово. Це дозволяє нам бути гнучкими та оперативними у будь-який час доби, гарантуючи вам надійну та своєчасну доставку вантажів.
    Наша мета - забезпечити вам першокласний сервіс та безпечну доставку вантажів до будь-яких місць. Ми пишаємося нашою здатністю забезпечити якість та задоволення наших клієнтів.
    Запрошуємо вас долучитися до нашої спільноти клієнтів, які довіряють нам свої грузи. Разом ми забезпечимо вашу перемогу в галузі грузоперевезень!
  </div>
</template>

<script setup>


</script>